{"loss": "binary_crossentropy", "config": [{"config": {"trainable": true, "batch_input_shape": [null, 12], "activity_regularizer": null, "input_dtype": "float32", "b_regularizer": null, "W_regularizer": null, "output_dim": 100, "init": "uniform", "activation": "relu", "W_constraint": null, "b_constraint": null, "bias": true, "name": "dense_1", "input_dim": 12}, "class_name": "Dense"}, {"config": {"trainable": true, "activation": "relu", "name": "dense_2", "activity_regularizer": null, "W_regularizer": null, "output_dim": 80, "init": "uniform", "b_constraint": null, "W_constraint": null, "bias": true, "b_regularizer": null, "input_dim": null}, "class_name": "Dense"}, {"config": {"trainable": true, "activation": "relu", "name": "dense_3", "activity_regularizer": null, "W_regularizer": null, "output_dim": 60, "init": "uniform", "b_constraint": null, "W_constraint": null, "bias": true, "b_regularizer": null, "input_dim": null}, "class_name": "Dense"}, {"config": {"trainable": true, "activation": "relu", "name": "dense_4", "activity_regularizer": null, "W_regularizer": null, "output_dim": 60, "init": "uniform", "b_constraint": null, "W_constraint": null, "bias": true, "b_regularizer": null, "input_dim": null}, "class_name": "Dense"}, {"config": {"trainable": true, "activation": "linear", "name": "dense_5", "activity_regularizer": null, "W_regularizer": null, "output_dim": 4, "init": "glorot_uniform", "b_constraint": null, "W_constraint": null, "bias": true, "b_regularizer": null, "input_dim": null}, "class_name": "Dense"}, {"config": {"name": "activation_1", "activation": "softmax", "trainable": true}, "class_name": "Activation"}], "optimizer": {"name": "Adam", "epsilon": 1e-08, "beta_2": 0.9990000128746033, "lr": 0.0010000000474974513, "beta_1": 0.8999999761581421}, "sample_weight_mode": null, "keras_version": "1.0.6", "class_name": "Sequential"}